#+TITLE: CEW Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle yes

#+begin_src elisp :tangle yes :comments no
;;; -*- lexical-binding: t -*-

;; The rest of your Emacs Lisp code follows...
(message "Lexical binding is: %S" lexical-binding)
#+end_src


** Capture Templates
#+begin_src emacs-lisp
  (defvar my/org-basic-task-template "* TODO %^{Task}
  :PROPERTIES:
  :Effort: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}
  :END:
  Captured %<%Y-%m-%d %H:%M>
  %?

  %i
  " "Basic task data")

  (setq org-capture-templates
        (quote
  (
  ("j" "Journal Entry" entry
   (file+olp+datetree "~/personal/journal.org")
  "* %U
  %?
  %i
  %a")

  ("k" "TKD Entry" entry
   (file+olp+datetree "~/personal/tkd.org")
  "* %U
  %?
  %i
  %a")
  	
  ("t" "Todo" entry
   (file+olp "~/gtd/gtd.org" "INBOX")
  "* TODO %?\n  %i\n  %a")

  ("m" "Meeting" entry
   (file+olp "~/gtd/notes.org" "Meetings")
   "* %U MEETING with %? :MEETING:
  ,** Notes

  ,** Actions
  "
   :clock-in t :clock-resume t)
  	
  ("p" "Phone" entry
   (file+olp "~/gtd/notes.org" "Meetings")
  "
  ,* %U CALL with %? :CALL:
   ,** Notes

   ,** Actions
   " :clock-in t :clock-resume t)
  	
  ("n" "Note" entry
   (file+headline "~/gtd/notes.org" "Notes")
   "* %u %?" :prepend t)
  )))
#+end_src

#+RESULTS:
| j | Journal Entry | entry | (file+olp+datetree ~/personal/journal.org) | * %U |


* Org Babel shell
#+begin_src emacs-lisp
  (use-package org-contrib
    :after org)

  ;; Load ob-sparql from org-contrib (if available)
  (with-eval-after-load 'org
    (require 'ob-shell nil 'noerror)
    (add-to-list 'org-babel-load-languages '(shell . t)))
#+end_src

#+RESULTS:
: ((shell . t) (sparql . t) (emacs-lisp . t))


